templates/playwright/test-data/soap/CountryInfo.ts.ejs

export const countryInfoSoapData = {
  capitalCity: {
    url: 'http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso',
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction:
      'http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso/CapitalCity',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CapitalCity>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.CapitalCityResponse.CapitalCityResult',
  },
  countryName: {
    url: 'http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso',
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction:
      'http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso/CountryName',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <CountryName xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CountryName>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.CountryNameResponse.CountryNameResult',
  },
};
